titanic datasını okuyunuz(<b>train.csv</b>). Ödevin geri kalanında dataframe gösterimlerini <b>display()</b> fonksiyonunu kullanarak yapınız.<br> Örn: display(titanic_df)

In [1]:
import pandas as pd
import numpy as np
file_name = "train"
titanic = pd.read_csv(f"{file_name}.csv")

display(titanic)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Soru 1:

Kazada ölenlerin yaş ortalamasını bulunuz

In [2]:
titanic[titanic.Survived == 0].Age.mean()

30.62617924528302

Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [3]:
titanic[titanic.Survived == 0].Fare.mean()

22.117886885245902

In [4]:
titanic[titanic.Survived == 0].Fare.median()

10.5

Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [5]:
titanic[(titanic["Survived"] == 0) & (titanic["Sex"] == "male")].Age.mean()

31.618055555555557

Kazada ölen Kadınların yaş ortalamasını bulunuz

In [6]:
titanic[(titanic["Survived"] == 0) & (titanic["Sex"] == "female")].Age.mean()

25.046875

# Soru 2:

Kazadan kurtulanların yaş ortalamasını bulunuz

In [7]:
titanic[titanic["Survived"]==1].Age.mean()

28.343689655172415

Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [8]:
titanic[titanic["Survived"]==1].Fare.mean()

48.39540760233918

Kazadan kurtulan toplam kişi sayısını bulunuz

In [9]:
titanic[titanic["Survived"]==1].Survived.sum()

342

Kazadan kurtulan erkeklerin yaş ortalamasını bulunuz

In [10]:
titanic[(titanic["Survived"]==1)&(titanic["Sex"]=="male")].Age.mean()

27.276021505376345

Kazadan kurtulan kadınların yaş ortalamasını bulunuz

In [11]:
titanic[(titanic["Survived"]==1)&(titanic["Sex"]=="female")].Age.mean()

28.84771573604061

# Soru 3:

10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [12]:
titanic[titanic["Age"] <= 10].Fare.median()

27.0

10 yaşından büyüklerin bilet fiyatlarının medyan değerini bulunuz

In [13]:
titanic[titanic["Age"] >= 10].Fare.median()

14.05415

# Soru 5:

1.sınıf, 2.sınıf ve 3.sınıf yolcuların ölüm oranlarını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [14]:
print("1.sınıf ölüm oranları:",len(titanic[(titanic["Pclass"]==1)&(titanic["Survived"]==0)])/len(titanic[(titanic["Pclass"]==1)]))
print("2.sınıf ölüm oranları:",len(titanic[(titanic["Pclass"]==2)&(titanic["Survived"]==0)])/len(titanic[(titanic["Pclass"]==2)]))
print("3.sınıf ölüm oranları:",len(titanic[(titanic["Pclass"]==3)&(titanic["Survived"]==0)])/len(titanic[(titanic["Pclass"]==3)]))
print("3>2>1")
# Ölüm oranı ve hangi sınıf yolcu oldukları arasında bir korelasyon olduğu gözüküyor kabaca pahalı olan biletlerin daha güvenli ve emniyetli olduğu söylenebilir.

1.sınıf ölüm oranları: 0.37037037037037035
2.sınıf ölüm oranları: 0.5271739130434783
3.sınıf ölüm oranları: 0.7576374745417516
3>2>1

1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarını karşılaştırınız

In [15]:
print("1.sınıf biletlerin ortalaması:",titanic[titanic["Pclass"]==1].Fare.mean())
print("2.sınıf biletlerin ortalaması:",titanic[titanic["Pclass"]==2].Fare.mean())
print("3.sınıf biletlerin ortalaması:",titanic[titanic["Pclass"]==3].Fare.mean())
print("1>2>3")

1.sınıf biletlerin ortalaması: 84.1546875
2.sınıf biletlerin ortalaması: 20.662183152173913
3.sınıf biletlerin ortalaması: 13.675550101832993
1>2>3

# Soru 6:

Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [16]:
k = len(titanic[(titanic["Survived"]==0) & (titanic["Sex"]=="female")])/len(titanic[titanic["Sex"]=="female"])
e = len(titanic[(titanic["Survived"]==0) & (titanic["Sex"]=="male")])/len(titanic[titanic["Sex"]=="male"])
print("Kadın ölüm oranı", k)
print("Erkek ölüm oranı", e)
#Erkeklerin ölüm oranı kadınlara kıyasla daha fazladır.

Kadın ölüm oranı 0.25796178343949044
Erkek ölüm oranı 0.8110918544194108

# Soru 7:

Kazada ölen erkeklerin ortalama bilet fiyatı ile kurtulan erkeklerin ortalama bilet fiyatını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [17]:
ö = titanic[(titanic["Survived"]==0) & (titanic["Sex"]=="male")].Fare.mean()
h = titanic[(titanic["Survived"]==1) & (titanic["Sex"]=="male")].Fare.mean()
print("Ölen erkeklerin biletlerinin ortalaması:", ö)
print("Yaşayan erkeklerin biletlerinin ortalaması:", h)
#Ölen erkeklerin biletlerinin ortalama fiyatı yaşayanların bilet ortalamasının yarısı kadar.

Ölen erkeklerin biletlerinin ortalaması: 21.96099294871795
Yaşayan erkeklerin biletlerinin ortalaması: 40.82148440366972

# Missing Value Doldurma

Bundan sonraki soruları <b>train_missing.csv</b> datasını kullanarak cevaplayınız.

In [18]:
titanic_missing=pd.read_csv("train_missing.csv")
display(titanic_missing.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN

# Soru 8

Age, Embarked ve Fare değişkenlerini mean/median/mode değerlerini kullanarak değişken tipine uygun olacak şekilde doldurunuz.

In [19]:
titanic_missing["Age"].fillna(titanic_missing["Age"].mean(), inplace = True)
titanic_missing["Embarked"].fillna(titanic_missing["Embarked"].mode()[0], inplace = True)
titanic_missing["Fare"].fillna(titanic_missing["Fare"].median(), inplace = True)

titanic_missing.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,S

# Soru 9

SibSp değişkeni hangi yöntemler ile doldurulabilir, fikir yürütün. Uygun bir yöntem ile doldurun. (SibSp değişkeni kişilerin gemide bulunan kardeş/eş sayısını belirtiyor.)

In [20]:
print(titanic_missing["SibSp"].unique())
titanic_missing["SibSp"].fillna(titanic_missing["SibSp"].mode(),inplace=True)
titanic_missing.head(20)
#modunu alabiliriz

[ 1.  0. nan  4.  3.  2.  5.  8.]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1.0,0,A/5 21171,7.25000,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1.0,0,PC 17599,71.28330,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0.0,0,STON/O2. 3101282,7.92500,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1.0,0,113803,53.10000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0.0,0,373450,8.05000,NaN,S
5,6,0,3,"Moran, Mr. James",male,29.699118,0.0,0,330877,8.45830,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0.0,0,17463,51.86250,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,NaN,1,349909,21.07500,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,NaN,2,347742,11.13330,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1.0,0,237736,30.07080,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.000000,1.0,1,PP 9549,16.70000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.000000,0.0,0,113783,14.45625,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.000000,0.0,0,A/5. 2151,14.45625,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.000000,1.0,5,347082,31.27500,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.000000,NaN,0,350406,7.85420,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.000000,0.0,0,248706,16.00000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.000000,4.0,1,382652,29.12500,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,29.699118,0.0,0,244373,14.45625,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.000000,1.0,0,345763,18.00000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,29.699118,0.0,0,2649,7.22500,NaN,S

# Soru 10

Datayı baştan okuyun. Embarked değişkenini "NAN" şeklinde yeni bir kategorisi olacak şekilde doldurun.

In [21]:
titanic_missing=pd.read_csv("train_missing.csv")
titanic_missing["Embarked"].fillna("NAN",inplace=True)
display(titanic_missing.head(10))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NAN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NAN
5,6,0,3,"Moran, Mr. James",male,NaN,0.0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0.0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,NaN,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,NaN,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1.0,0,237736,30.0708,NaN,C

# Soru 11

"Fare" değişkeni için "Fare_Missing" adında yeni bir değişken türetip "Fare" değişkenini median ile doldurun.

In [28]:
new_index = titanic_missing[titanic_missing["Fare"].isnull()]["Fare"].index.to_list()
titanic_missing["Fare_Missing"].fillna(titanic_missing["Fare"].median(),inplace=True)
titanic_missing.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Fare_Missing,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,0,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,0,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,0,NaN,NAN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,0,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,0,NaN,NAN